In [3]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('spam.csv', encoding='latin-1')

In [6]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
2014,ham,Ambrith..madurai..met u in arun dha marrge..re...,NaN,NaN,NaN
312,ham,He says he'll give me a call when his friend's...,NaN,NaN,NaN
5358,ham,Hmm. Shall i bring a bottle of wine to keep us...,NaN,NaN,NaN
3197,ham,7 lor... Change 2 suntec... Wat time u coming?,NaN,NaN,NaN
2261,ham,Did you show him and wot did he say or could u...,NaN,NaN,NaN

In [7]:
df.shape

(5572, 5)

In [ ]:
#1. Data cleaning
#2. EDA
#3. Text preprocessing 
#4. Model building
#5. Evaluation
#6. Improvement 
#7. Website
#8. Deployment

In [ ]:
#DATA CLEANING

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [9]:
#drop last 3 cols
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True )

In [10]:
df.sample(5)

        v1                                                 v2
707    ham  Quite late lar... Ard 12 anyway i wun b drivin...
5319   ham                       Kothi print out marandratha.
4116   ham  Sure thing big man. i have hockey elections at...
4705   ham  Wow so healthy. Old airport rd lor. Cant thk o...
1374  spam  500 New Mobiles from 2004, MUST GO! Txt: NOKIA...

In [12]:
#renaming the cols
df.rename(columns={'v1':'target','v2':'text'},inplace=True)
df.sample(6)

     target                                               text
5122    ham  \NOT ENUFCREDEIT TOCALL.SHALL ILEAVE UNI AT 6 ...
3367    ham           Hey elaine, is today's meeting still on?
202     ham  Your account has been refilled successfully by...
2626    ham      Unni thank you dear for the recharge..Rakhesh
2281    ham  I hav almost reached. Call, i m unable to conn...
308    spam  TheMob> Check out our newest selection of cont...

In [13]:
#convert text to numbers
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [17]:
df['target'] = encoder.fit_transform(df['target'])
# 0 - ham 1 - spam

In [16]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [19]:
#missing values
df.isnull().sum() 
# when sum is added it returns t/f value in numbers

target    0
text      0
dtype: int64

In [20]:
# check for dupe values
df.duplicated().sum()

403

In [23]:
#first occurence of that row
df= df.drop_duplicates(keep='first')

In [24]:
df.duplicated().sum()

0

In [26]:
df.shape

(5169, 2)

In [ ]:
#EDA
Exploratory Data Analysis